doc/html/paths.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Nitrogen 2.x Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-11-22 10:50:06 EST"/>
<meta name="author" content="Rusty Klophaus (@rklophaus)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">

<h1 class="title">Nitrogen 2.x Documentation</h1>

<p><a href="./index.html">Getting Started</a> | API | <a href="./elements.html">Elements</a> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <a href="./about.html">About</a>
</p>


<div class=headline>Nitrogen Paths</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview </a></li>
<li><a href="#sec-2">2 How Are Paths Matched? </a></li>
<li><a href="#sec-3">3 Nitrogen Specific Selectors </a></li>
<li><a href="#sec-4">4 jQuery Selectors </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview </h2>
<div class="outline-text-2" id="text-1">


<p>
Nitrogen 2.x allows you to reference element paths using jQuery
selectors. These selectors can be used in three contexts:
</p>
<ul>
<li>
As the target (first parameter) of <code>wf:wire/2</code>,
<code>wf:update/2</code>, <code>wf:insert_top/2</code>,
<code>wf:insert_bottom/2</code>, etc.

</li>
<li>
As the trigger (first parameter) or target (second parameter) of
<code>wf:wire/3</code>.

</li>
<li>
As the <code>trigger</code> or <code>target</code> of an <code>#event{}</code>
action.

</li>
</ul>

<p>Path matching in Nitrogen is complicated because it must provide a
simple, straight-forward interface while still accounting for potential
name-collisions due to the nested nature of Nitrogen elements.
</p>
<p>
For example, you should be able to create two elements with the same
ID, but in different areas of the element hierarchy, and be able to
reference those elements in predictable ways.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How Are Paths Matched? </h2>
<div class="outline-text-2" id="text-2">


<p>
The <code>objs(Path, Anchor)</code> function is used to match selectors on the
client. This is defined in <i>nitrogen.js</i>, and returns a jQuery
object containing all of the elements that match the selector
provided under <code>Path</code>, potentially in close proximity to the
selector provided under <code>Anchor</code>. If <code>Anchor</code> is not provided, then
the anchor set by <code>Nitrogen.$anchor(Anchor, Target)</code> is used. 
</p>
<p>
<code>Nitrogen.$anchor/2</code> is automatically called by Nitrogen before each
action is rendered. The <code>Anchor</code> value is set to the uniquely
generated temp ID for the element to which the action applies, it
will look something like <code>.wfid_temp23422</code>.
</p>
<p>
Unless you are doing some wacky stuff, your application should not
need to worry about calling <code>objs()</code> or <code>Nitrogen.$anchor()</code>
directly, but it helps to know what is happening behind the scenes
in case you need to debug.
</p>
<p>
If you are trying to wire an action or update a command, and the
statement seems to affect the wrong elements, it may help to drop
down into a Javascript console and run <code>objs(YourPath)</code> to see what
is actually getting matched.
</p>

</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Steps To Match a Path </h3>
<div class="outline-text-3" id="text-2_1">


<p>
Here are the steps that the <code>objs()</code> function takes when matching a
path.
</p>
<ol>
<li>
If the selector has multiple parts separated by commas, then the
selector is split, and each part is combined.

</li>
<li>
If the selector is "page", then a reference to the DOM document
is returned.

</li>
<li>
The string "\#\#" is replaced with ".wfid_". This allows you to
specify Nitrogen elementIDs in a string selector. For example
"\#\#myelementid &gt; .someclass" will be rewritten to
".wfid<sub>myelementid</sub> &gt; .someclass". This is done because Nitrogen
uses classes to tag your elements with their ID, so an element
with ID of 'myelementid' will be tagged with a class called
'.wfid<sub>myelementid'</sub>.

</li>
<li>
If the string "me" is found surrounded by non-word characters,
it is replaced with the anchor that was set. This allows
you to write paths such as "me &gt; .image" which will apply to all
elements with class ".image" under the current element.

</li>
<li>
If the path is a one word string and it is the name of an HTML
element such as "table", "div", "h1", etc., then try matching as
a Nitrogen element ID first, and if that doesn't work, then try
matching as an HTML element.

</li>
<li>
If a string is found containing only words separated by periods
(for example, "element1.element2"), then it is assumed to be a
nested series of elements, and is converted to ".wfid<sub>element1</sub>
.wfid<sub>element2</sub>". This will match all Nitrogen elements named
'element2' underneath any Nitrogen elements named 'element1'.

</li>
<li>
If the path begins with "body", then match using a call to
<code>jQuery(path)</code>. This will match any elements in the context of the
entire document.

</li>
<li>
Otherwise, Nitrogen will try to match elements as closely as
possible starting at the current anchor. First, try to match the
path under the current anchor using
<code>jQuery(anchor).find(path)</code>. If results were found, then stop
and return.  Otherwise, call <code>jQuery(anchor).parents()</code> to get a
list of parents, and then for each parent, call
<code>jQuery(parent).find(path)</code>. If results were found, then stop
and return.

</li>
<li>
Finally, if no elements were found, then Nitrogen resorts to
matching <code>jQuery(path)</code>.

</li>
</ol>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Nitrogen Specific Selectors </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Selector: me </h3>
<div class="outline-text-3" id="text-3_1">

<p>A keyword to specify the context of the current anchor. In other
words, if you wire an event to an element, then 'me' will point to that element.
</p>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Selecter: ##element </h3>
<div class="outline-text-3" id="text-3_2">

<p>A shortcut for referring to a Nitrogen element when you specify a
string path. Because of the way Nitrogen uses class names to tag
elements, this is the same as specifying ".wfid<sub>element</sub>".
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> jQuery Selectors </h2>
<div class="outline-text-2" id="text-4">


<p>
Selectors and descriptions below are pulled directly from the [[http://api.jquery.com/category/selectors/][jQuery Selectors Documentation].
</p>

</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Selector: * </h3>
<div class="outline-text-3" id="text-4_1">

<p>Selects all elements.
</p>
</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> Selector: :animated </h3>
<div class="outline-text-3" id="text-4_2">

<p>Select all elements that are in the progress of an animation at the
time the selector is run.
</p>
</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> Selector: Attribute Contains Prefix [name|=value] </h3>
<div class="outline-text-3" id="text-4_3">

<p>Selects elements that have the specified attribute with a value
either equal to a given string or starting with that string
followed by a hyphen (-).
</p>
</div>

</div>

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> Selector: Attribute Contains [name*=value] </h3>
<div class="outline-text-3" id="text-4_4">

<p>Selects elements that have the specified attribute with a value
containing the a given substring.
</p>
</div>

</div>

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3">4.5</span> Selector: Attribute Contains Word [name~=value] </h3>
<div class="outline-text-3" id="text-4_5">

<p>Selects elements that have the specified attribute with a value
containing a given word, delimited by spaces.
</p>
</div>

</div>

<div id="outline-container-4_6" class="outline-3">
<h3 id="sec-4_6"><span class="section-number-3">4.6</span> Selector: Attribute Ends With [name$=value] </h3>
<div class="outline-text-3" id="text-4_6">

<p>Selects elements that have the specified attribute with a value
ending exactly with a given string.
</p>
</div>

</div>
