doc/org-mode/paths.org
** Selector: Attribute Equals Selector [name=value]
   Selects elements that have the specified attribute with a value
   exactly equal to a certain value.

** Selector: Attribute Not Equal Selector [name!=value]
   Select elements that either don't have the specified attribute, or
   do have the specified attribute but not with a certain value.

** Selector: Attribute Starts With Selector [name^=value]
   Selects elements that have the specified attribute with a value
   beginning exactly with a given string.

** Selector: :button Selector
   Selects all button elements and elements of type button.

** Selector: :checkbox Selector
   Selects all elements of type checkbox.

** Selector: :checked Selector
   Matches all elements that are checked.

** Selector: Child Selector ("parent > child")
   Selects all direct child elements specified by "child" of elements
   specified by "parent".

** Selector: Class Selector (".class")
   Selects all elements with the given class.

** Selector: :contains() Selector
   Select all elements that contain the specified text.

** Selector: Descendant Selector ("ancestor descendant")
   Selects all elements that are descendants of a given ancestor.

** Selector: :disabled Selector
   Selects all elements that are disabled.

** Selector: Element Selector ("element")
   Selects all elements with the given tag name.

** Selector: :empty Selector
   Select all elements that have no children (including text nodes).

** Selector: :enabled Selector
   Selects all elements that are enabled.

** Selector: :eq() Selector
   Select the element at index n within the matched set.

** Selector: :even Selector
   Selects even elements, zero-indexed. See also odd.

** Selector: :file Selector
   Selects all elements of type file.

** Selector: :first-child Selector
   Selects all elements that are the first child of their parent.

** Selector: :first Selector
   Selects the first matched element.

** Selector: :gt() Selector
   Select all elements at an index greater than index within the
   matched set.

** Selector: Has Attribute Selector [name]
   Selects elements that have the specified attribute, with any value.

** Selector: :has() Selector
   Selects elements which contain at least one element that matches
   the specified selector.

** Selector: :header Selector
   Selects all elements that are headers, like h1, h2, h3 and so on.

** Selector: :hidden Selector
   Selects all elements that are hidden.

** Selector: ID Selector ("#id")
   Selects a single element with the given id attribute.

** Selector: :image Selector
   Selects all elements of type image.

** Selector: :input Selector
   Selects all input, textarea, select and button elements.

** Selector: :last-child Selector
   Selects all elements that are the last child of their parent.

** Selector: :last Selector
   Selects the last matched element.

** Selector: :lt() Selector
   Select all elements at an index less than index within the matched
   set.

** Selector: Multiple Attribute Selector [name=value][name2=value2]
   Matches elements that match all of the specified attribute filters.

** Selector: Multiple Selector ("selector1, selector2, selectorN")
   Selects the combined results of all the specified selectors.

** Selector: Next Adjacent Selector ("prev + next")
   Selects all next elements matching "next" that are immediately
   preceded by a sibling "prev".

** Selector: Next Siblings Selector ("prev ~ siblings")
   Selects all sibling elements that follow after the "prev" element,
   have the same parent, and match the filtering "siblings" selector.

** Selector: :not() Selector
   Selects all elements that do not match the given selector.

** Selector: :nth-child Selector
   Selects all elements that are the nth-child of their parent.

** Selector: :odd Selector
   Selects odd elements, zero-indexed. See also even.

** Selector: :only-child Selector
   Selects all elements that are the only child of their parent.

** Selector: :parent Selector
   Select all elements that are the parent of another element,
   including text nodes.

** Selector: :password Selector
   Selects all elements of type password.

** Selector: :radio Selector
   Selects all elements of type radio.

