doc/html/paths.html

<div id="outline-container-4_7" class="outline-3">
<h3 id="sec-4_7"><span class="section-number-3">4.7</span> Selector: Attribute Equals Selector [name=value] </h3>
<div class="outline-text-3" id="text-4_7">

<p>Selects elements that have the specified attribute with a value
exactly equal to a certain value.
</p>
</div>

</div>

<div id="outline-container-4_8" class="outline-3">
<h3 id="sec-4_8"><span class="section-number-3">4.8</span> Selector: Attribute Not Equal Selector [name!=value] </h3>
<div class="outline-text-3" id="text-4_8">

<p>Select elements that either don't have the specified attribute, or
do have the specified attribute but not with a certain value.
</p>
</div>

</div>

<div id="outline-container-4_9" class="outline-3">
<h3 id="sec-4_9"><span class="section-number-3">4.9</span> Selector: Attribute Starts With Selector [name^=value] </h3>
<div class="outline-text-3" id="text-4_9">

<p>Selects elements that have the specified attribute with a value
beginning exactly with a given string.
</p>
</div>

</div>

<div id="outline-container-4_10" class="outline-3">
<h3 id="sec-4_10"><span class="section-number-3">4.10</span> Selector: :button Selector </h3>
<div class="outline-text-3" id="text-4_10">

<p>Selects all button elements and elements of type button.
</p>
</div>

</div>

<div id="outline-container-4_11" class="outline-3">
<h3 id="sec-4_11"><span class="section-number-3">4.11</span> Selector: :checkbox Selector </h3>
<div class="outline-text-3" id="text-4_11">

<p>Selects all elements of type checkbox.
</p>
</div>

</div>

<div id="outline-container-4_12" class="outline-3">
<h3 id="sec-4_12"><span class="section-number-3">4.12</span> Selector: :checked Selector </h3>
<div class="outline-text-3" id="text-4_12">

<p>Matches all elements that are checked.
</p>
</div>

</div>

<div id="outline-container-4_13" class="outline-3">
<h3 id="sec-4_13"><span class="section-number-3">4.13</span> Selector: Child Selector ("parent &gt; child") </h3>
<div class="outline-text-3" id="text-4_13">

<p>Selects all direct child elements specified by "child" of elements
specified by "parent".
</p>
</div>

</div>

<div id="outline-container-4_14" class="outline-3">
<h3 id="sec-4_14"><span class="section-number-3">4.14</span> Selector: Class Selector (".class") </h3>
<div class="outline-text-3" id="text-4_14">

<p>Selects all elements with the given class.
</p>
</div>

</div>

<div id="outline-container-4_15" class="outline-3">
<h3 id="sec-4_15"><span class="section-number-3">4.15</span> Selector: :contains() Selector </h3>
<div class="outline-text-3" id="text-4_15">

<p>Select all elements that contain the specified text.
</p>
</div>

</div>

<div id="outline-container-4_16" class="outline-3">
<h3 id="sec-4_16"><span class="section-number-3">4.16</span> Selector: Descendant Selector ("ancestor descendant") </h3>
<div class="outline-text-3" id="text-4_16">

<p>Selects all elements that are descendants of a given ancestor.
</p>
</div>

</div>

<div id="outline-container-4_17" class="outline-3">
<h3 id="sec-4_17"><span class="section-number-3">4.17</span> Selector: :disabled Selector </h3>
<div class="outline-text-3" id="text-4_17">

<p>Selects all elements that are disabled.
</p>
</div>

</div>

<div id="outline-container-4_18" class="outline-3">
<h3 id="sec-4_18"><span class="section-number-3">4.18</span> Selector: Element Selector ("element") </h3>
<div class="outline-text-3" id="text-4_18">

<p>Selects all elements with the given tag name.
</p>
</div>

</div>

<div id="outline-container-4_19" class="outline-3">
<h3 id="sec-4_19"><span class="section-number-3">4.19</span> Selector: :empty Selector </h3>
<div class="outline-text-3" id="text-4_19">

<p>Select all elements that have no children (including text nodes).
</p>
</div>

</div>

<div id="outline-container-4_20" class="outline-3">
<h3 id="sec-4_20"><span class="section-number-3">4.20</span> Selector: :enabled Selector </h3>
<div class="outline-text-3" id="text-4_20">

<p>Selects all elements that are enabled.
</p>
</div>

</div>

<div id="outline-container-4_21" class="outline-3">
<h3 id="sec-4_21"><span class="section-number-3">4.21</span> Selector: :eq() Selector </h3>
<div class="outline-text-3" id="text-4_21">

<p>Select the element at index n within the matched set.
</p>
</div>

</div>

<div id="outline-container-4_22" class="outline-3">
<h3 id="sec-4_22"><span class="section-number-3">4.22</span> Selector: :even Selector </h3>
<div class="outline-text-3" id="text-4_22">

<p>Selects even elements, zero-indexed. See also odd.
</p>
</div>

</div>

<div id="outline-container-4_23" class="outline-3">
<h3 id="sec-4_23"><span class="section-number-3">4.23</span> Selector: :file Selector </h3>
<div class="outline-text-3" id="text-4_23">

<p>Selects all elements of type file.
</p>
</div>

</div>

<div id="outline-container-4_24" class="outline-3">
<h3 id="sec-4_24"><span class="section-number-3">4.24</span> Selector: :first-child Selector </h3>
<div class="outline-text-3" id="text-4_24">

<p>Selects all elements that are the first child of their parent.
</p>
</div>

</div>

<div id="outline-container-4_25" class="outline-3">
<h3 id="sec-4_25"><span class="section-number-3">4.25</span> Selector: :first Selector </h3>
<div class="outline-text-3" id="text-4_25">

<p>Selects the first matched element.
</p>
</div>

</div>

<div id="outline-container-4_26" class="outline-3">
<h3 id="sec-4_26"><span class="section-number-3">4.26</span> Selector: :gt() Selector </h3>
<div class="outline-text-3" id="text-4_26">

<p>Select all elements at an index greater than index within the
matched set.
</p>
</div>

</div>

<div id="outline-container-4_27" class="outline-3">
<h3 id="sec-4_27"><span class="section-number-3">4.27</span> Selector: Has Attribute Selector [name] </h3>
<div class="outline-text-3" id="text-4_27">

<p>Selects elements that have the specified attribute, with any value.
</p>
</div>

</div>

<div id="outline-container-4_28" class="outline-3">
<h3 id="sec-4_28"><span class="section-number-3">4.28</span> Selector: :has() Selector </h3>
<div class="outline-text-3" id="text-4_28">

<p>Selects elements which contain at least one element that matches
the specified selector.
</p>
</div>

</div>

<div id="outline-container-4_29" class="outline-3">
<h3 id="sec-4_29"><span class="section-number-3">4.29</span> Selector: :header Selector </h3>
<div class="outline-text-3" id="text-4_29">

<p>Selects all elements that are headers, like h1, h2, h3 and so on.
</p>
</div>

</div>

<div id="outline-container-4_30" class="outline-3">
<h3 id="sec-4_30"><span class="section-number-3">4.30</span> Selector: :hidden Selector </h3>
<div class="outline-text-3" id="text-4_30">

<p>Selects all elements that are hidden.
</p>
</div>

</div>

<div id="outline-container-4_31" class="outline-3">
<h3 id="sec-4_31"><span class="section-number-3">4.31</span> Selector: ID Selector ("#id") </h3>
<div class="outline-text-3" id="text-4_31">

<p>Selects a single element with the given id attribute.
</p>
</div>

</div>

<div id="outline-container-4_32" class="outline-3">
<h3 id="sec-4_32"><span class="section-number-3">4.32</span> Selector: :image Selector </h3>
<div class="outline-text-3" id="text-4_32">

<p>Selects all elements of type image.
</p>
</div>

</div>

<div id="outline-container-4_33" class="outline-3">
<h3 id="sec-4_33"><span class="section-number-3">4.33</span> Selector: :input Selector </h3>
<div class="outline-text-3" id="text-4_33">

<p>Selects all input, textarea, select and button elements.
</p>
</div>

</div>

<div id="outline-container-4_34" class="outline-3">
<h3 id="sec-4_34"><span class="section-number-3">4.34</span> Selector: :last-child Selector </h3>
<div class="outline-text-3" id="text-4_34">

<p>Selects all elements that are the last child of their parent.
</p>
</div>

</div>

<div id="outline-container-4_35" class="outline-3">
<h3 id="sec-4_35"><span class="section-number-3">4.35</span> Selector: :last Selector </h3>
<div class="outline-text-3" id="text-4_35">

<p>Selects the last matched element.
</p>
</div>

</div>

<div id="outline-container-4_36" class="outline-3">
<h3 id="sec-4_36"><span class="section-number-3">4.36</span> Selector: :lt() Selector </h3>
<div class="outline-text-3" id="text-4_36">

<p>Select all elements at an index less than index within the matched
set.
</p>
</div>

</div>

<div id="outline-container-4_37" class="outline-3">
<h3 id="sec-4_37"><span class="section-number-3">4.37</span> Selector: Multiple Attribute Selector [name=value][name2=value2] </h3>
<div class="outline-text-3" id="text-4_37">

<p>Matches elements that match all of the specified attribute filters.
</p>
</div>

</div>

<div id="outline-container-4_38" class="outline-3">
<h3 id="sec-4_38"><span class="section-number-3">4.38</span> Selector: Multiple Selector ("selector1, selector2, selectorN") </h3>
<div class="outline-text-3" id="text-4_38">

<p>Selects the combined results of all the specified selectors.
</p>
</div>

</div>

<div id="outline-container-4_39" class="outline-3">
<h3 id="sec-4_39"><span class="section-number-3">4.39</span> Selector: Next Adjacent Selector ("prev + next") </h3>
<div class="outline-text-3" id="text-4_39">

<p>Selects all next elements matching "next" that are immediately
preceded by a sibling "prev".
</p>
</div>

</div>

<div id="outline-container-4_40" class="outline-3">
<h3 id="sec-4_40"><span class="section-number-3">4.40</span> Selector: Next Siblings Selector ("prev ~ siblings") </h3>
<div class="outline-text-3" id="text-4_40">

<p>Selects all sibling elements that follow after the "prev" element,
have the same parent, and match the filtering "siblings" selector.
</p>
</div>

</div>

<div id="outline-container-4_41" class="outline-3">
<h3 id="sec-4_41"><span class="section-number-3">4.41</span> Selector: :not() Selector </h3>
<div class="outline-text-3" id="text-4_41">

<p>Selects all elements that do not match the given selector.
</p>
</div>

</div>

<div id="outline-container-4_42" class="outline-3">
<h3 id="sec-4_42"><span class="section-number-3">4.42</span> Selector: :nth-child Selector </h3>
<div class="outline-text-3" id="text-4_42">

<p>Selects all elements that are the nth-child of their parent.
</p>
</div>

</div>

<div id="outline-container-4_43" class="outline-3">
<h3 id="sec-4_43"><span class="section-number-3">4.43</span> Selector: :odd Selector </h3>
<div class="outline-text-3" id="text-4_43">

<p>Selects odd elements, zero-indexed. See also even.
</p>
</div>

</div>

<div id="outline-container-4_44" class="outline-3">
<h3 id="sec-4_44"><span class="section-number-3">4.44</span> Selector: :only-child Selector </h3>
<div class="outline-text-3" id="text-4_44">

<p>Selects all elements that are the only child of their parent.
</p>
</div>

</div>

<div id="outline-container-4_45" class="outline-3">
<h3 id="sec-4_45"><span class="section-number-3">4.45</span> Selector: :parent Selector </h3>
<div class="outline-text-3" id="text-4_45">

<p>Select all elements that are the parent of another element,
including text nodes.
</p>
</div>

</div>

<div id="outline-container-4_46" class="outline-3">
<h3 id="sec-4_46"><span class="section-number-3">4.46</span> Selector: :password Selector </h3>
<div class="outline-text-3" id="text-4_46">

<p>Selects all elements of type password.
</p>
</div>

</div>

<div id="outline-container-4_47" class="outline-3">
<h3 id="sec-4_47"><span class="section-number-3">4.47</span> Selector: :radio Selector </h3>
<div class="outline-text-3" id="text-4_47">

<p>Selects all elements of type radio.
</p>
</div>

</div>
